Учет_кабельной_продукции/src/Documents/ЗаявкаНаМонтаж/ЗаявкаНаМонтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаМонтаж</name>
  <basedOn>Catalog.ЖурналыУчетаКабельнойПродукции</basedOn>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЗаявкиНаМонтажСтатусы</registerRecords>
  <registerRecords>InformationRegister.ДанныеПоЗаданиямПоПрокладкеКабелей</registerRecords>
  <registerRecords>InformationRegister.РазрешениеМонтажаКПП</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаМонтаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиВМонтаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчетаОМонтаже</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьМонтаж</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретитьМонтаж</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/Documents/ЗаявкаНаМонтаж/ManagerModule.bsl
#Область Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ИКЖ";
	//КомандаПечати.Представление = "ИКЖ";
	//КомандаПечати.Обработчик = "УправлениеПечатьюКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм = "ФормаДокумента, ФормаСписка";

	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ИКЖ_1";
	//КомандаПечати.Представление = "ИКЖ_1";
	//КомандаПечати.Обработчик = "УправлениеПечатьюКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм = "ФормаДокумента, ФормаСписка";
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыПечати.ДоступнаПечатьКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "") Тогда   
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "", "",
			СформироватьПечать(МассивОбъектов), "Документ.ЖурналыУчетаКабельнойПродукции");  
			
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьПечать(МассивОбъектов)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Возврат ТабДокумент;
	
КонецФункции
#КонецОбласти   

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;	
	Результат.Добавить("Статус;ФормаЗаписать,ФормаУстановитьПометкуУдаления");
	Результат.Добавить("ДатаВыдачиВМонтаж");
	Результат.Добавить("ДатаОтчетаОМонтаже");
	Результат.Добавить("Подрядчик");
	Результат.Добавить("КабельныеЛинии");
	Возврат Результат;
	
КонецФункции
